MI4Bap/app/Models/FilmModel.php

    public function getAllData(){
       return $this->FindAll();
---
SELECT *
FROM `film`