MI4Bap/app/Models/genreModel.php

    public function getAllData(){
       return $this->FindAll();
---
SELECT *
FROM `genre`